
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВладелецСвойств = Параметры.СсылкаНаОбъект;
	ВывестиПоляДополнительныхСвойствНаФорму();
	ЗаполнитьРеквизитыДополнительныхСвойств();
	
КонецПроцедуры

&НаСервере
Процедура ВывестиПоляДополнительныхСвойствНаФорму()
	
	СвойстваОбъекта = Параметры.СвойстваОбъекта;
	РеквизитыСвойств = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(СвойстваОбъекта, "ИдентификаторДляФормул, ТипЗначения, Наименование, ВладелецДополнительныхЗначений");
	
	ДобавляемыеРеквизиты = Новый Массив;
	Для каждого Свойство Из СвойстваОбъекта Цикл
		
		Идентификатор = РеквизитыСвойств[Свойство].ИдентификаторДляФормул;
		ТипЗначения = РеквизитыСвойств[Свойство].ТипЗначения;
		НовыйРеквизит = Новый РеквизитФормы(Идентификатор, ТипЗначения);
		ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
		
	КонецЦикла;
	
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	Для каждого Свойство Из СвойстваОбъекта Цикл
		
		Идентификатор = РеквизитыСвойств[Свойство].ИдентификаторДляФормул;
		Наименование = РеквизитыСвойств[Свойство].Наименование;
		ВладелецДополнительныхЗначений = РеквизитыСвойств[Свойство].ВладелецДополнительныхЗначений;
		ТипЗначения = РеквизитыСвойств[Свойство].ТипЗначения;
		ЭтоДополнительноеЗначение = УправлениеСвойствамиСлужебный.ТипЗначенияСодержитЗначенияСвойств(ТипЗначения);
		Булево = ОбщегоНазначения.ОписаниеТипаСостоитИзТипа(ТипЗначения, Тип("Булево"));
		
		НовыйЭлемент = Элементы.Добавить(Идентификатор, Тип("ПолеФормы"), Элементы.ГруппаСвойства);
		НовыйЭлемент.ПутьКДанным = Идентификатор;
		НовыйЭлемент.Заголовок = Наименование;
		Если Булево Тогда
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
			НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
		Иначе
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
		КонецЕсли;
		
		Если ЭтоДополнительноеЗначение Тогда
			ПараметрыВыбора = Новый Массив;
			ПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.Владелец",
			?(ЗначениеЗаполнено(ВладелецДополнительныхЗначений),
			ВладелецДополнительныхЗначений, Свойство)));
			НовыйЭлемент.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбора);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьРеквизитыДополнительныхСвойств()
	ЗначенияСвойств = УправлениеСвойствами.ЗначенияСвойств(ВладелецСвойств);
	ИдентификаторыСвойств = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(Параметры.СвойстваОбъекта, "ИдентификаторДляФормул");
	
	Для каждого СтрокаСвойства Из ЗначенияСвойств Цикл
		Идентификатор = ИдентификаторыСвойств[СтрокаСвойства.Свойство];
		ЭтотОбъект[Идентификатор] = СтрокаСвойства.Значение;	
	КонецЦикла;
	
КонецПроцедуры
